-- Пользователи
-- Магазины
-- Производители
-- Товары
-- Корзина
-- Заказы
-- Любимые магазины
-- Любимые товары

-- Пользователи
-- айди
-- почта
-- номер телефона
-- пароль
-- дата регистрации
-- любимые магазины
-- заказы

-- Любимые магазины
-- пользователь
-- магазин

-- Любимые товары
-- пользователь
-- товар

-- Магазины
-- айди
-- название
-- адрес
-- график работы
-- товары

-- Товары
-- айди
-- название
-- цена
-- скидка
-- производитель

-- Производитель
-- айди
-- название
-- адрес
-- дата регистрации
-- товары

-- Корзина
-- пользователь
-- товар

-- Заказы
-- айди
-- общая сумма
-- дата заказа
-- пользователь
